#n = int(input('Введите число: '))
#print(n + 2)



#Задача 2:
# while True:
n = int(input('Введите число больше 0 но меньше 10: '))
if n > 0 and n < 10:
    print(n**2)
    # break
else:
        print('Введите число удовлетворяющее требованию')